---
type: ExternalResourceType
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ExternalResourceType

`Autodesk.Revit.DB.ExternalResourceType` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalResourceType | — | `public ExternalResourceType ( Guid guid )` |